#𝘾𝒂𝙢𝒆𝙡-𝙘𝒂𝙨𝒆 არის რამოდენიმე სიტყვისგან შექმნილი წინადადება და მათ შუაში იწერება ქვედა ტირე: _
#𝙘𝒂𝙨𝒆-𝒔𝙚𝒏𝙨𝒊𝙩𝒊𝙫𝒆 არის ნებისმიერი ცვლადი რომელიც ინახება დიდი და პატარა ასოებით და განსხვავდება

#---------------------------------------------------------------------------------
#𝗗𝗲𝗯𝘂𝗴𝗴𝗶𝗻𝗴:

#Debugging არის ჩვენ მიერ დაშვებული ნებისმიერი შეცდომა და არ ასრულებს ბრძანებას შესაბამისად.

#------------------------------------------------------------------------------------------------

#1
name = 'zura'      
print(name)
#2
age=13     
print(age)
#3
Hello_world = "Hello"
print("Hello_world")
#4
name2 = 'nika'
print(name2)
#5
year=2025
print(year)