// stack - მონაცემთა ტიპები რომლებიც ინახავენ პატარა ადგილს
// heap - მონაცემტა ტიპები რომლებიც ინახავენ დიდ ადგილს

// პრიმიტიული მონაცემთა ტიპები არის რომელიც ინახავს 1 მნიშვნელობას მაგ:

let name = "Tornike"
let age = 12
let TornikeKnowsCoding = true

// კომპლექსური მონაცემთა ტიპები არის ისეთი რომელიც ინახავს 1 ზე მეტ მნიშვნელობას მაგ:

let names = ["Demetre", "Tornike", "Aleksandre"]

let car = {
    color: "black",
    model: "Bmw",
    seats: 4
}

// მოდულარულობა - არის კოდი რომელიც უფრო მარტივად სამართავია, მარტივად გასაგებს ხდის და ბევრჯერ გამოყენებადს ხდის


greet() // იმუშავებს მიუხედავად იმისა რომ ფუნქცია გამოძახებულია იქამდე სანამ ფუნქცია შეიქმნა

function greet(username) {
    console.log("Hello", username)
}

// მაგრამ hoisting არ მუშაობს ცვლადებთან

// js engine - V8
// react - არის css html და js გაერთიანება და ასევე მოდულების ბიბლიოთეკა