# 1)რა არის Variable? მოიტანე 2 სწორი და 1 არასწორი სახელის მაგალითი.

#Variable არის ცვლადი, ცვლადი არის ყუთი რომელშიც ვინახავთ მნიშვნელობას. მაგ: name = "Tornike", GOA = "Best", "5" = 5


# 2)რას აბრუნებს type(5)?

#type(5) დააბრუნებს intenger-ს იმიტომ რომ type ამოწმებს მონაცემთა ტიპს


# 3)რა განსხვავებაა Parameter და Argument შორის?

#def greet(name): 
    #print("Hello" "" + name)
#greet("Tornike") ---- "Tornike" არის არგუმენტი, name არის პარამეტრი



# 4)აირჩიე Immutable ტიპი:

# a) list

# (b) str

# c) bool

# 5)რას აკეთებს my_list.append(x)?

#ლისტში დაამატეს x-ს


# 6)თუ ფუნქციაში return არ წერია, რას აბრუნებს?

#თუ ფუნქციაში return არ გვიწერია არაფერს არ დააბრუნებს



# 7)რა განსხვავებაა == და != შორის?

#== ნიშნავს რომ რაღაცა უდრის რაღაცას მაგ: name == "nika"
#!= ნიშნავს რომ რაღაცა (არ) უდრის რაღაცას მაგ: name != "nika"

# 8)რას აბრუნებს:

# s = 'Python'
# s[0:3]
#დააბრუნებს Pyt-ს


# 9) str.upper() რას აკეთებს?
#გაადაიდებს სტრინგის ყველა ასოს