// stack - მონაცემთა ტიპები რომლებიც ინახავენ პატარა ადგილს
// heap - მონაცემტა ტიპები რომლებიც ინახავენ დიდ ადგილს

// მოდულარულობა - არის კოდი რომელიც უფრო მარტივად სამართავია, მარტივად გასაგებს ხდის და ბევრჯერ გამოყენებადს ხდის

// js engine - V8


// hoisting:

greet() // იმუშავებს მიუხედავად იმისა რომ ფუნქცია გამოძახებულია იქამდე სანამ ფუნქცია შეიქმნა

function greet(username) {
    console.log("Hello", username)
}

// react - არის მოდულების ბიბლიოტეკა და მაგალითად ცსს ჯს სა და ჰტმლ ს გაერთიანება