// 1) let-სა და var-ს შორის ის განსხვავებაა რომ როდესაც კლაკნილ ფრჩხილებში ლეთით ვქმნით ცვლადს, იმ ცვლადს კლაკნილი ფრჩხილების გარეთ
//  ვერ მივწვდებით, ხოლო var-ით შექმნილ ცვლადს შეგვიძლია კლაკნილი ფრჩხილების გარეთაც მივწვდეთ!

// 2) Global scope -> როცა ცვლადი არის ყველაფრის გარეთ შექმნილი, მას შეგვიძლია ნებისმიერ ადგილას მივწვდეთ, ყველა scope-ში გლობალ სკოუპში რომელ ცვლადსაც შევქმნით ის გლობალური იქნება, არააქ მნიშვნელობა ეს იქნება var let ან const

let thisIsGlobal = "Global"

// Function Scope - არის როდესაც ცვლადი არის ფუნქციის შიგნით შექმნილი და ვერ მივწვდებით ფუნქციის გარედან არააქ მნიშვნელობა როგორი ცვლადი იქნება

function no(){
    youCantCatchMe = "true"
}

console.log(youCantCatchMe)

// Global scope - არის როდესაც ცვლადი არის შექმნილი {} ფრჩხილებში და ვერ ვწვდებით {}-ს გარეთ, სწორეთ ამით ვლინდება ლეთის და ვარის განსხვავება რადგან ვარით მაინც შეგვიძლია მივწვდეთ ფუნქციის გარეთ, ეს არის არასწორი და ამიტომ შექმნეს ლეთი და ვარი აღარ გამოიყენება ძირითადად